; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v7 - type_2 ?v3 - type_1)
 	      (pred_2 ?v1 - object ?v3 - type_1)
	      (pred_3 ?v7 - type_2 ?v2 - type_3)
	      (pred_1 ?v7 - type_2 ?v1 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v7 - type_2 ?v8 ?v5 - type_1)
       :precondition (and  (pred_4 ?v7 ?v8))
       :effect (and  (pred_4 ?v7 ?v5)
		     (not (pred_4 ?v7 ?v8))))

   (:action op_2
       :parameters (?v7 - type_2 ?v4 - object ?v6 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v6) (pred_4 ?v7 ?v6) (pred_3 ?v7 ?v2))
       :effect (and (pred_1 ?v7 ?v4 ?v2)
		    (not (pred_2 ?v4 ?v6)) 
		    (not (pred_3 ?v7 ?v2))))

   (:action op_1
       :parameters (?v7 - type_2 ?v4 - object ?v6 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v4 ?v2) (pred_4 ?v7 ?v6))
       :effect (and (pred_2 ?v4 ?v6)
		    (pred_3 ?v7 ?v2)
		    (not (pred_1 ?v7 ?v4 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_06 obj_10 - type_2
obj_11 obj_07 obj_09 obj_13 - type_3
obj_04 obj_01 obj_03 obj_05 - type_1
obj_02 obj_12 obj_08 - object)
(:init
(pred_4 obj_06 obj_03)
(pred_3 obj_06 obj_11)
(pred_3 obj_06 obj_07)
(pred_4 obj_10 obj_03)
(pred_3 obj_10 obj_09)
(pred_3 obj_10 obj_13)
(pred_2 obj_02 obj_04)
(pred_2 obj_12 obj_05)
(pred_2 obj_08 obj_04)
)
(:goal
(and
(pred_2 obj_02 obj_05)
(pred_2 obj_12 obj_04)
(pred_2 obj_08 obj_04)
)
)

(:constraints
  (always (not (pred_4 obj_06 obj_05)))
)
)

; plan
1. (op_3 obj_06 obj_03 obj_04)
   deleted: (pred_4 obj_06 obj_03)
   added: (pred_4 obj_06 obj_04)
   goals met: 1 of 3
2. (op_3 obj_10 obj_03 obj_04)
   deleted: (pred_4 obj_10 obj_03)
   added: (pred_4 obj_10 obj_04)
   goals met: 1 of 3
3. (op_3 obj_06 obj_04 obj_01)
   deleted: (pred_4 obj_06 obj_04)
   added: (pred_4 obj_06 obj_01)
   goals met: 1 of 3
4. (op_2 obj_10 obj_02 obj_04 obj_13)
   deleted: (pred_2 obj_02 obj_04) (pred_3 obj_10 obj_13)
   added: (pred_1 obj_10 obj_02 obj_13)
   goals met: 1 of 3
5. (op_3 obj_10 obj_04 obj_05)
   deleted: (pred_4 obj_10 obj_04)
   added: (pred_4 obj_10 obj_05)
   goals met: 1 of 3
6. (op_1 obj_10 obj_02 obj_05 obj_13)
   deleted: (pred_1 obj_10 obj_02 obj_13)
   added: (pred_2 obj_02 obj_05) (pred_3 obj_10 obj_13)
   goals met: 2 of 3
7. (op_2 obj_10 obj_12 obj_05 obj_09)
   deleted: (pred_2 obj_12 obj_05) (pred_3 obj_10 obj_09)
   added: (pred_1 obj_10 obj_12 obj_09)
   goals met: 2 of 3
8. (op_3 obj_10 obj_05 obj_04)
   deleted: (pred_4 obj_10 obj_05)
   added: (pred_4 obj_10 obj_04)
   goals met: 2 of 3
9. (op_1 obj_10 obj_12 obj_04 obj_09)
   deleted: (pred_1 obj_10 obj_12 obj_09)
   added: (pred_2 obj_12 obj_04) (pred_3 obj_10 obj_09)
   goals met: 3 of 3
